# საკლასო დავალება: მომხმარებელს შემოატანინეთ 2 რიცხვი, num1, num2.
# თუ პირველი მეტია მეორეზე, შექმენით დიაპაზონი მეორე რიცხვიდან პირველი რიცხვის ჩათვლით და დაბეჭდეთ მხოლოდ ლუწი.
# ხოლო თუ მეორე რიცხვი მეტია პირველზე, შექმენით დიაპაზონი პირველიდან მეორეს ჩათვლით და დაბეჭდეთ მხოლოდ კენტი რიცხვები.
# საბოლოოდ დაბეჭდეთ ყველა ამ დაბეჭდილი რიცხვის ჯამი.


num1 = int(input("შეიყვანეთ პირველი რიცხვი: "))
num2 = int(input("შეიყვანეთ მეორე რიცხვი: "))

if num1 > num2:
    numbers = range(num2, num1 + 1)
    result = [num for num in numbers if num % 2 == 0] 

else:
    numbers = range(num1, num2 + 1)
    result = [num for num in numbers if num % 2 != 0]  

print("გამოსული რიცხვები:", result)

print("ჯამი:", sum(result))