# quiz 

# 1 

print(type("HELLO, World!"));

# ეს დაგვიბეწდავს class 'str'

# 2

# ძიეზის დახმარებით

# 3

# range() ფუნქციას ვიყენებთ რიცხვითი მიმდევრობების შესაქმნელად.

# 4 

# ინფორმაციას input() - ის საშვალებით შეგვიძლია შემოვატანინოთ მომხმარებელს.

# 5 

# ციკლი შეიქმნება for- ით

# 6 

# float- ით

# 7 

# კოდი დაგვიბეჭდავს False

#  8 

# უსასრულო ციკლს შევქმნით while - ით

# 9 

print ('Hello' + 'World')

# დაბეჭდავს HelloWorld

#  10

print(4 % 2)

# დაბეჭდავს 0-ს

# 11 

# .py 

# 12 

# დაბეჭდავს True 

# 13 

print('5' * 3)

# კოდი დაბეჭდავს 555-ს

print('Hello'[-1])

# დაბეჭდავს o-ს

# 14

print(list(range(2, 10, 2)))

# დაბეჭდავს [2, 4, 6, 8]-ს

# 15

# while ციკლს ვიყენებთ, როდესაც გვინდა, რომ კოდი შესრულდეს მანამ, სანამ გარკვეული პირობა მართალია

# 16

# True და False

# 17 

# and- ით