# საკლასო დავალება: შექმენით სია, რომელშიც იქნება 10 ელემენტი. 
# შემდეგ მომხმარებელს შემოატანინეთ რიცხვი და შეინახეთ მთელი რიცხვის სახით.
# თუ ეს რიცხვი მეტია ან ტოლია 0-ზე და ნაკლებია სიის სიგრძეზე, მაშინ სიიდან ამ ინდექსზე მყოფი ელემენტი წამოიღეთ და დაბეჭდეთ.
# თუ ეს რიცხვი მეტია ან ტოლია "სიის სიგრძე გამრავლებული -1ზე" და ნაკლებია ან ტოლია -1 ზე, მაშინ დაბეჭდეთ ამ ინდექსზე მყოფი ელემენტი.



my_list = [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]

list_length = 10  

number = int(input("შეიყვანეთ რიცხვი: "))

if 0 <= number < list_length:
    print("ელემენტი:", my_list[number])
elif -list_length <= number < 0:
    print("ელემენტი:", my_list[number])
else:
    print("რიცხვი არ არის სწორი.")
