# საკლასო დავალება: შექმენით ფუნქცია სახელად manual_range, რომელსაც გადაეცემა სამი პარამეტრი (start, end, step).
# ფუნქციის დავალებაა რომ გადაცემული პარამეტრებით შეადგინოს დიაპაზონი, შემდეგ ამ დიაპაზონს გადავუაროთ ციკლით და დავბეჭდოთ მხოლოდ ლუწი რიცხვები.
# ფუნქციის გამოძახებისას მას აუცილებლად უნდა გადაეცეს 3 არგუმენტი.
# ფუნქცია გამოიძახეთ მინიმუმ 5-ჯერ სხვადასხვა არგუმენტებით

def manual_range(start, end, step):
    for i in range(start, end, step):
        if i % 2 == 0:
            print(i)

manual_range(0, 20, 4)  
manual_range(2, 20, 2)  
manual_range(2, 15, 3)  
manual_range(-8, 8, 2)

