# საკლასო დავალება: შექმენით ფუნქცია სახელად manual_len, რომელსაც ექნება გაწერილი 1 პარამეტრი.

# ფუნქციას გადაეცემა სია და მისი დავალებაა რომ დააბრუნოს სიის სიგრძე (len არ გამოიყენოთ). უნდა გამოიყენოთ for ან while ციკლი და ერთი ცვლადი. საბოლოოდ დაბეჭდეთ სიის სიგრძე.

# ფუნქციის გამოძახებისას გადაეცემა მას ერთი არგუმენტი - სია

def manual_len(start):
    
    count = 0
    
    for i in start:
        count += 1
    
    print("სიის სიგრძე:", count)

manual_len([1, 2, 3, 4, 5])  
manual_len([])  
manual_len(['a', 'b', 'c']) 
manual_len([10])  
manual_len(list(range(100)))  
